[net]
batch=64
subdivisions=8
width=640
height=640
channels=3
angle=10.000000
jitter=0.200000
jitter_scale=1.500000
saturation=0.700000
exposure=0.400000
hue=0.015000
max_boxes=200
learning_rate=0.000010
burn_in=100
max_batches=5000000
policy=steps
steps=600,2000,35000
scales=1.000000,1.000000,1.000000
momentum=0.900000
decay=0.000500
mosaic=0
npts=0
p_size=0
q_size=0
abc_size=0
xyz_size=0
cal_anchors=0
seen_per_map=20000
pts2center=1
data_probs=1
iou_image=1
loss_scale=1.000000

[convolutional]
batch_normalize=1
filters=24
size=3
stride=1
pad=1
activation=leaky

[maxpool]
stride=2
size=2

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear

[maxpool]
stride=2
size=2

[convolutional]
batch_normalize=1
filters=49
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=182
size=3
stride=1
pad=1
activation=linear

[convolutional]
batch_normalize=1
filters=136
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=134
size=3
stride=1
pad=1
activation=leaky

[route]
layers = 8,7

[convolutional]
batch_normalize=1
filters=136
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=7
activation=linear
nweights=2
beta=13.380345
beta_nms=-0.000018

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=12
activation=linear
nweights=1
beta=0.000005

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=12
activation=linear
nweights=2
beta=4.082489
beta_nms=0.000000

[maxpool]
stride=2
size=2

[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=0
activation=leaky

[convolutional]
batch_normalize=1
filters=1027
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=1024
size=3
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = 22,12

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = 25,8

[convolutional]
batch_normalize=1
filters=133
size=3
stride=1
pad=1
activation=leaky

[upsample]
stride=2

[route]
layers = 28,5

[shortcut]
from=6
activation=linear
nweights=1
beta=0.000001

[shortcut]
from=29
activation=linear
nweights=1
beta=0.000000

[convolutional]
batch_normalize=1
filters=65
size=3
stride=1
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=5
size=1
stride=1
pad=0
activation=linear

[softmax_array]
type=sse
ratio=0.500000

